Revit 2024 API
RibbonItemType Enumeration
An enumerated type listing all the toolbar item styles.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum RibbonItemType
Visual Basic
Public Enumeration RibbonItemType
Visual C++
public enum class RibbonItemType
Members
Member name | Description
PushButton | A standard button with text and image.
PulldownButton | A button with a pull-down menu list.
SplitButton | A split button with a default button and a pull-down menu list.
ToggleButton | A standard button that can be added to RadioButtonGroup.
RadioButtonGroup | An item that contains a collection of RibbonToggleButton items.
ComboBoxMember | An item in the drop-down list of a ComboBox.
ComboBox | A selection control with a drop-down list that can be shown or hidden by clicking the arrow on the control.
TextBox | A text-based control that allows the user to enter text.
See Also
Autodesk.Revit.UI Namespace